--- 各类平衡性常数
BOMB_DAMAGE = 100 -- 炸弹对怪物所造成的伤害

-- 移动对射击的偏移影响因数，这个数字越大，移动对射击的影响就越小
MOVING_SHOOTING_RELATED_RATIO = 4

-- 每一层的金币给予玩家的金钱数量
-- 一定要严格控制给予玩家的总金钱数量
-- 
MAX_COIN_DROP_PER_ROOM_MAX = 6 -- 每个房间最多掉落5个金币
MAX_COIN_DROP_PER_ROOM_MIN = 4 -- 每个房间最多掉落5个金币
COIN_DROP_CHANCE = 60 -- 每个房间的每个生物掉落金币的概率
GOLD_COIN_PER_LEVEL = {
	[1] = {80, 130}, -- 1层的每个金币给予玩家的金钱数量
	[2] = {100, 150}, -- 2层的每个金币给予玩家的金钱数量
	[3] = {120, 170}, -- 3层的每个金币给予玩家的金钱数量
	[4] = {140, 200}, -- 4层的每个金币给予玩家的金钱数量
	[5] = {170, 250}, -- 5层的每个金币给予玩家的金钱数量
	[6] = {200, 300}, -- 6层的每个金币给予玩家的金钱数量
	[7] = {230, 330}, -- 7层的每个金币给予玩家的金钱数量
	[8] = {260, 360}, -- 8层的每个金币给予玩家的金钱数量
}

-- 每一层的普通房间的数量
NORMAL_ROOM_COUNT = {
	{min = 5, max = 7}, -- 1 1000 5000 5000
	{min = 5, max = 8}, -- 2 1600 8000 13000
	{min = 6, max = 8}, -- 3 1600 10000 23000
	{min = 6, max = 9}, -- 4 2000 12000 35000
	{min = 7, max = 9}, -- 5 2100 15000 50000
	{min = 7, max = 10}, -- 6 2300 20000 70000
	{min = 8, max = 10}, -- 7 2500 25000 95000
	{min = 8, max = 11}, -- 8 3000 30000 125000
}

SEMI_BOSS_ROOM_CHANCE = 20
BONUS_ROOM_CHANCE = 10

HERO_RESPAWN_DELAY = 3 -- 英雄死亡后的重生时间（战斗中复活应当作为某些特殊的技能来装备）